app/controllers/songs_controller.rb

  def show
    if params[:artist_id]
      @artist = Artist.find(params[:artist_id])
      @song = @artist.songs.find(params[:id])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]